# Module 4 project
# Author : Uma M Subramanian
# Repo: https://github.com/umams2002/datafun-04-notebooks

## Task 1. Create DataFrame

In [80]:
import pandas as pd
grades_dict = {"Eva": [56,78,89],
               "Wally": [45,34,90],
               "Uma": [99,100,99],
               "Sam": [45,89,10],
               "Mark": [23,67,66]}
grades = pd.DataFrame(grades_dict)
grades

   Eva  Wally  Uma  Sam  Mark
0   56     45   99   45    23
1   78     34  100   89    67
2   89     90   99   10    66

## Task 2. Custom Index

In [81]:
grades.index = ['Test1','Test2','Test3']
grades.Sam

Test1    45
Test2    89
Test3    10
Name: Sam, dtype: int64

In [82]:
grades['Eva']

Test1    56
Test2    78
Test3    89
Name: Eva, dtype: int64

## Task 3. Accessing Rows (loc, iloc)

In [83]:
grades.loc["Test1"]

Eva      56
Wally    45
Uma      99
Sam      45
Mark     23
Name: Test1, dtype: int64

In [84]:
grades.iloc[2]

Eva      89
Wally    90
Uma      99
Sam      10
Mark     66
Name: Test3, dtype: int64

In [85]:
grades.loc['Test1':'Test3']

       Eva  Wally  Uma  Sam  Mark
Test1   56     45   99   45    23
Test2   78     34  100   89    67
Test3   89     90   99   10    66

In [86]:
grades.iloc[0:2]

       Eva  Wally  Uma  Sam  Mark
Test1   56     45   99   45    23
Test2   78     34  100   89    67

## Task 3. Accessing Subsets (at, iat)

In [87]:
grades.at["Test2","Eva"]

78

In [88]:
grades.iat[2,0]

89

## Task 4. Describe (By Column)

In [89]:
grades.describe()

        Eva  Wally    Uma   Sam  Mark
count   3.0    3.0    3.0   3.0   3.0
mean   74.3   56.3   99.3  48.0  52.0
std    16.8   29.7    0.6  39.6  25.1
min    56.0   34.0   99.0  10.0  23.0
25%    67.0   39.5   99.0  27.5  44.5
50%    78.0   45.0   99.0  45.0  66.0
75%    83.5   67.5   99.5  67.0  66.5
max    89.0   90.0  100.0  89.0  67.0

In [90]:
pd.set_option('display.precision',2)
grades.describe()

         Eva  Wally     Uma    Sam   Mark
count   3.00   3.00    3.00   3.00   3.00
mean   74.33  56.33   99.33  48.00  52.00
std    16.80  29.67    0.58  39.59  25.12
min    56.00  34.00   99.00  10.00  23.00
25%    67.00  39.50   99.00  27.50  44.50
50%    78.00  45.00   99.00  45.00  66.00
75%    83.50  67.50   99.50  67.00  66.50
max    89.00  90.00  100.00  89.00  67.00

## Task 5. Transpose (rows <--> columns)

In [91]:
grades.mean()

Eva      74.33
Wally    56.33
Uma      99.33
Sam      48.00
Mark     52.00
dtype: float64

In [92]:
grades.T

       Test1  Test2  Test3
Eva       56     78     89
Wally     45     34     90
Uma       99    100     99
Sam       45     89     10
Mark      23     67     66

In [93]:
grades.T.describe()

       Test1   Test2  Test3
count   5.00    5.00   5.00
mean   53.60   73.60  70.80
std    28.07   25.32  36.11
min    23.00   34.00  10.00
25%    45.00   67.00  66.00
50%    45.00   78.00  89.00
75%    56.00   89.00  90.00
max    99.00  100.00  99.00

## Task 6. Sort

In [94]:
grades.sort_index(ascending=False)

       Eva  Wally  Uma  Sam  Mark
Test3   89     90   99   10    66
Test2   78     34  100   89    67
Test1   56     45   99   45    23

In [95]:
grades.sort_index(axis=1)

       Eva  Mark  Sam  Uma  Wally
Test1   56    23   45   99     45
Test2   78    67   89  100     34
Test3   89    66   10   99     90